xml/request/remoteAccessRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://oss.dbc.dk/ns/openagency">
   <soapenv:Body>
      <open:remoteAccessRequest>
         <!--Optional:-->
         <open:authentication>
            <open:groupIdAut>?</open:groupIdAut>
            <open:passwordAut>?</open:passwordAut>
            <open:userIdAut>?</open:userIdAut>
         </open:authentication>
         <open:agencyId>DK-718300</open:agencyId>
      </open:remoteAccessRequest>
   </soapenv:Body>
</soapenv:Envelope>
