xml/request/serviceRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://oss.dbc.dk/ns/openagency"><SOAP-ENV:Body>
<ns1:serviceRequest>
 <ns1:agencyId>DK-810010</ns1:agencyId>
 <ns1:service>information</ns1:service>
</ns1:serviceRequest>
</SOAP-ENV:Body></SOAP-ENV:Envelope>
