xml/request/automationRequest_autPotential_2.xml

<?xml version="1.0" encoding="UTF-8"?>\n<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://oss.dbc.dk/ns/openagency"><SOAP-ENV:Body>
<ns1:automationRequest>
 <ns1:agencyId>DK-820040</ns1:agencyId>
 <ns1:autService>autPotential</ns1:autService>
 <ns1:materialType>1</ns1:materialType>
</ns1:automationRequest>
</SOAP-ENV:Body></SOAP-ENV:Envelope>
