xml/request/pickupAgencyListRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://oss.dbc.dk/ns/openagency">
   <soapenv:Header/>
   <soapenv:Body>
      <open:pickupAgencyListRequest>
         <!--Optional:-->
         <open:authentication>
            <open:groupIdAut>?</open:groupIdAut>
            <open:passwordAut>?</open:passwordAut>
            <open:userIdAut>?</open:userIdAut>
         </open:authentication>
         <!--You have a CHOICE of the next 2 items at this level-->
         <!--Zero or more repetitions:-->
         <open:agencyId>?</open:agencyId>
         <!--Zero or more repetitions:-->
         <open:agencyName>?</open:agencyName>
         <!--Zero or more repetitions:-->
         <open:agencyAddress>?</open:agencyAddress>
         <!--Zero or more repetitions:-->
         <open:postalCode>?</open:postalCode>
         <!--Zero or more repetitions:-->
         <open:city>?</open:city>
         <!--Optional:-->
         <open:libraryType>?</open:libraryType>
         <!--Optional:-->
         <open:libraryStatus>?</open:libraryStatus>
         <!--Optional:-->
         <open:pickupAllowed>?</open:pickupAllowed>
         <!--Optional:-->
         <open:callback>?</open:callback>
         <!--Optional:-->
         <open:outputType>?</open:outputType>
      </open:pickupAgencyListRequest>
   </soapenv:Body>
</soapenv:Envelope>
