commons/utils/open-agency-connector/src/test/resources/mappings/mapping-(root)-ltvWN.json

{
  "request" : {
    "url" : "/",
    "method" : "POST",
    "bodyPatterns" : [ {
      "equalToXml" : "<?xml version=\"1.0\" ?><S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\"><S:Body><ns1:serviceRequest xmlns:ns1=\"http://oss.dbc.dk/ns/openagency\"><ns1:agencyId>100300</ns1:agencyId><ns1:service>information</ns1:service></ns1:serviceRequest></S:Body></S:Envelope>"
    } ]
  },
  "response" : {
    "status" : 200,
    "bodyFileName" : "body-(root)-ltvWN.json",
    "headers" : {
      "Date" : "Tue, 21 Jun 2016 08:47:18 GMT",
      "Server" : "Apache",
      "Content-Length" : "1349",
      "Connection" : "close",
      "Content-Type" : "text/xml; charset=utf-8",
      "Set-Cookie" : "SERVERID=OpenAgency-3; path=/"
    }
  }
}